{"section_id": "page", "title": "About - Kalinga Institute of Industrial Technology (KIIT)", "url": "https://kiit.ac.in/about/", "scraped_from": "turn0view0", "content": "Main About page for KIIT with multiple subsections (Overview, Quick Facts, Vision, Mission, Leadership, Testimonials, Why KIIT is named so, Outreach Activities, Founder profile)."}
{"section_id": "founder_bio", "title": "Prof. Achyuta Samanta - Founder & Mentor, KIIT", "text": "Achyuta Samanta, after obtaining Master’s Degree in Chemistry in 1987 from Utkal University, started his career at 22 years of age. He has 30 years of teaching experience to his credit. Prof. Samanta served as KIIT's first Chancellor and has been the youngest Chancellor of any Indian University. He served on the University Grants Commission (UGC) and was a member of the Executive Committee of AICTE.", "metadata": {"role": "Founder & Mentor", "education": "M.Sc. Chemistry (Utkal University)", "start_year": 1987}}
{"section_id": "quick_facts", "title": "Quick Facts", "data": {"world_class_campuses": "30+", "faculty_and_researchers": "3000+", "learners": "40,000+", "sports_complexes": 18, "food_courts": 30, "township_area_sq_km": 36}}
{"section_id": "overview", "title": "Overview", "text": "Kalinga Institute of Industrial Technology (KIIT) is a sought-after destination in India for professional studies. Started in 1992-93 as an Industrial Training Institution (ITI), and with 1997 as the base year for expanded courses, the university has grown rapidly to offer undergraduate, postgraduate and PhD programs across many schools. KIIT now hosts over 30,000 students in university programs and additional learners across other programmes, including around 2000 international students from about 65 countries. The campus spans a 36-square-kilometre academic township with extensive facilities including a super speciality hospital (KIMS), a central library, research wings, auditoriums, sports complexes and more."}
{"section_id": "rankings_accreditations", "title": "Rankings & Recognition (excerpt)", "text": "KIIT is ranked in the 501-600 cohort in the Times Higher Education World University Ranking 2026. Its Computer Science Engineering ranks in the 301-400 cohort and overall Engineering ranks 401-500 globally. KIIT has A++ grade by NAAC and was ranked 17th by NIRF (India). It was the top private university for innovation (AICTE) in 2020 and 2021, and ranked 168 in Times Higher Education Young University Ranking 2024. KIIT has produced 23 Olympians and received multiple sports awards."}
{"section_id": "vision", "title": "Vision", "text": "To create an advanced centre of professional learning of international standing where pursuit of knowledge and excellence shall reign supreme, unfettered by the barriers of nationality, language, cultural plurality and religion."}
{"section_id": "mission", "title": "Mission", "text": ["Imparting value based quality education of international standard and imbibing skill for solving real life problems.", "Inculcating global perspective in attitude.", "Creating leadership qualities with futuristic vision.", "Fostering spirit of entrepreneurship and realisation of societal responsibilities.", "Cultivating adaptation of ethics, morality and healthy practices in professional life.", "Instilling habit of continual learning.", "Encouraging and supporting creative abilities and research temperament.", "Establishing and promoting close interaction with industries and other utility sectors and keeping abreast with state-of-the-art technology."]}
{"section_id": "leadership_excerpt", "title": "Leadership (excerpt)", "leaders": [{"name": "Mr. Ashok Kumar Parija", "role": "Chancellor"}, {"name": "Prof. (Dr.) Subrata Kumar Acharya", "role": "Pro-Chancellor"}, {"name": "Prof. (Dr.) Saranjit Singh", "role": "Vice Chancellor"}, {"name": "Prof. (Dr.) Raju K.D", "role": "Pro-Vice Chancellor"}, {"name": "Prof. (Dr.) C.B.K. Mohanty", "role": "Pro-Vice Chancellor, School of Medicine"}, {"name": "Prof. (Dr.) Jnyana Ranjan Mohanty", "role": "Registrar"}]}
{"section_id": "global_ambassador", "title": "Global Ambassador", "text": "Dr Niklaus Samuel Gugger - Global Ambassador, KIIT & KISS. Member of the Swiss Parliament and President of Swiss India Parliamentary Group. Born in Kannur and later adopted to Switzerland; serves in ambassadorial role for KIIT & KISS."}
{"section_id": "testimonials_excerpt", "title": "Testimonials (selected)", "testimonials": [{"author": "Prof. Rolf M. Zinkernagel", "quote": "We thank KIIT and its management for a wonderful conference, an impressive inauguration..."}, {"author": "Dr. Robert S. Zeigler", "quote": "I have been extraordinarily impressed with the phenomenal work undertaken by KIIT/KISS..."}, {"author": "Dr. A P J Abdul Kalam", "quote": "I congratulate Dr. Samanta for establishing institutions of character like KIIT and KISS..."}, {"author": "Shri M. Hamid Ansari", "quote": "KIIT goes way beyond what I had expected to see..."}]}
{"section_id": "why_named", "title": "Why KIIT is named so?", "text": "The name blends historical and symbolic elements: 'Kalinga' refers to the ancient region (present-day Odisha) and its legacy; 'IIT' refers to its origins as an Industrial Training Institute. The founder's personal symbolism around the letter 'K' is also noted."}
